samples/ec-site/out/state.puml
@startuml
[*] --> Pending
Paid --> Shipped : Start Shipping
Pending --> Cancelled : Cancel Order
Pending --> Paid : Capture Payment
Shipped --> Delivered : Confirm Delivery
@enduml
